tutorials/WTG_multirowWindFarm/0.orig/fp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      fp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            calculated;
        value           uniform 0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }

    sides
    {
        type            symmetry;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    /*
    concentrator
    {
        type            calculated;
        value           uniform 0;
    }*/

}


// ************************************************************************* //
