tutorials/WTG_multirowWindFarm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale               1;

// x = streamwise
// y = spanwise
// z = wall-normal



vertices
(
(		-630	-1260	0	)	//0
(		2520	-1260	0	)	//1
(		2520	1260	0	)	//2
(		-630	1260	0	)	//3
(		-630	-1260	2016.00	)	//4
(		2520	-1260	2016.00	)	//5
(		2520	1260	2016.00	)	//6
(		-630	1260	2016.00	)	//7



);

blocks
(
    hex (0 1 2 3 4 5 6 7) (194 92 91)  
    simpleGrading 
    (
    (
	(	0.08000	0.061856	0.3509	)
	(	0.64000	0.824742	1.0000	)
	(	0.28000	0.113402	7.4000	)


    )
    (
	(	0.35000	0.173913	0.0833	)
	(	0.30000	0.652174	1.0000	)
	(	0.35000	0.173913	12.0000	)

    )
    
	(
	(0.1875 0.824176 89)
	(0.8125 0.175824 15.4)
	)
	
    
    )
);


edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type symmetry;
        faces
        (
            (1 5 4 0)
            (2 3 7 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
