tutorials/WTG_multirowWindFarm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Make sure all utilities know specialised models
libs            (atmosphericModels.so ); //libMyRadialActuationDiskSource2012.so

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      2;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

functions
{
  probes
    {
	type 	probes;
	libs	("libsampling.so");
	writeControl	timeStep;
	writeInterval	50;
	
	fields
	(
		U
		k
	);
	probeLocations
	(
	(0 0 90)
	(315 0 90)
	(630 0 90)
	(945 0 90)
	);
    }

#include "FOvolFieldValue"

}


// ************************************************************************* //
